[
  {
    "name": "Big Whiskey's American Restaurant ",
    "address": "6587 Las Vegas Blvd S",
    "city": "Las Vegas",
    "state": "NV",
    "source": "TripAdvisor",
    "tags": [

    ],
    "reviews": [
      "Went to Big whiskey's last night and we were lucky to get a table given how busy it was for a Monday. They had a championship flair bar tending championship that they hold once a month on the first Monday of the week. I had.",
      "New restaurant in Town Square just opened. Huge inventory of Whiskey.... had the half rack with loaded fries and the best cold slaw I've had !!! Extensive menu moderately priced. Gotta try this new place, you wont be disappointed.",
      "We had reservations for Friday night and we were really excited to try this place after reading its menu online-  The seating hostess was very friendly and gave us more information than our actual server. Then we waited about 10 minutes for a server to.",
      "Booked table for Mother’s Day evening meal on arrival was shown to table but server refused to acknowledge our presence but went out of her way to ask tables around us if everything was ok each time she passed she made it clear she would.",
      "We had a fun night. The servers were great and really knew their stuff. Excellent bar selection as you would expect. The food was all good, nothing great but nothing to complain about. If you are in the area it's a good pick for a.",
      "Super happy hour prices, good food, Beanita (Christina) was the best server—great customer service! I would totally recommend Big Whiskey.",
      "Stopped by for lunch with my sister. Didn’t realise it was a new establishment (until the waitress pointed it out after quite a long wait for our food). Had the buffalo chicken wontons for apps. They were good. Then a long wait for our mains..",
      "Quite a large menu of varied foods at moderate prices. Also a huge selection of whiskey! I ate there when it first opened and there bugs to worked out. The staff was not friendly, I think they were consumed with the operational aspects and not."
    ]
  },
  {
    "name": "Oyster Bar at Palace Station",
    "address": "2411 W Sahara Ave",
    "city": "Las Vegas",
    "state": "NV",
    "source": "TripAdvisor",
    "tags": [
      "Lunch",
      " Dinner",
      " Breakfast",
      " Late Night",
      "American",
      " Seafood",
      " Soups",
      "Takeout",
      " Parking Available",
      " Serves Alcohol",
      " Full Bar",
      " Accepts Credit Cards"
    ],
    "reviews": [
      "Went here with my friends last night. The wait was extremely long as there is very limited seating. The food was worth the wait. I had the steamed clams and the combo pan roast. Both were absolutely amazingly good and tasty. I will definitely go.",
      "Oh my goodness - fresh oysters and clams and the seafood based soup was tasty.  The service was great and sitting up in the bar gave you insight to the orchestra of your meal prepared.",
      "We waited in line for 30 minutes. We waited for our food for 30 minutes. And we would wait DOUBLE that to eat there again. Absolutely phenomenal food and service!!!!",
      "We lucked out with a less than 30 minute wait to sit but we waited about 35 minutes after ordering to get our meal but it was worth it. The peel and eat shrimp are so perfectly delicious! We also had the combo pan roast.",
      "Speaking as a non-seafood eater this place was excellent! A friend made me go, even though she knows I don’t care for seafood. They will tell you what the top seller is to that’s excellent, I don’t recall the name. But I’m told there is.",
      "Really fresh oyster for $1 each. We tried the top 3 dishes, seafood Gumbo, seafood pan roast and seafood bouillabaisse!!!! Amazing!!!!! Huge portion, delicious and fresh seafood ingredient, great value for money! The only downside is that seats are limited and queues are long. But.",
      "It’s been in my bucket list to dine at this restaurant because of all the hype. But they did warn me about the wait. We got lucky our wait was only 15 mins. We ordered the combo pot roast, clam chowder New England, and oyster..",
      "My husband and I live in Summerlin...so Las Vegas locals. Have been wanting to try this place for sometime but hesitant after reading some reviews...great food but long wait times, etc.\n\nToday, Monday, we decided to give it a try. We walked in at about.",
      "I found this place in Vegas and was eager to try. When I arrived I noticed 3 bar stools open and I sat at the one in the middle. The cook said please do not sit yet and pointed to the block long line to.",
      "The Oyster Bar is one of my favorite dining spots in Las Vegas. The on the half shell oysters are fresh and the oyster stew is great."
    ]
  },
  {
    "name": "Joel Robuchon",
    "address": "3799 Las Vegas Blvd S",
    "city": "Las Vegas",
    "state": "NV",
    "source": "TripAdvisor",
    "tags": [
      "$250 - $385",
      "Vegetarian Friendly",
      " Vegan Options",
      " Gluten Free Options",
      "Dinner",
      " Late Night",
      "French",
      "Reservations",
      " Private Dining",
      " Seating",
      " Parking Available",
      " Valet Parking",
      " Wheelchair Accessible",
      " Serves Alcohol",
      " Full Bar",
      " Accepts Credit Cards",
      " Table Service"
    ],
    "reviews": [
      "This restaurant is a haven in a crazy, loud and ugly hotel. \n\nThe service is amazing and the food spectacular. Interesting and pleasingly delicious combinations of flavors. \n\nWe had the degustation menu with paired wines, it was wonderful. \n\nHighly recommended.",
      "The food was amazing staff was attentive and perfect my only complaint is the reason I gave it four stars instead of five because of the many surcharges in addition to the exorbitant prices I feel that the staff should point out the surcharge for.",
      "Indoor design of the restaurant, along with beautiful chandelier were all stunning. Decorated to the detail with dark brown and purple colors added to classy and elegant ambiance we experienced.\nMy friend and myself both ordered 8 course tasting menu, which consists of 17 little.",
      "this is the best part of vegas wow wow wow visited yesterday was recommned by a friend we will be coming back in august",
      "We had a lovely dinner at Joel Robuchon’s.  Service started out a little “cold” perhaps because they were apprehensive about our young children, but once the staff realized our kids weren’t going to swing on the beautiful crystal chandelier or set curtains on fire they.",
      "French food always is and adventure but here was so delicious!\nThe bread was out of this world, try the tasting menu!",
      "It’s actually only the second time we’ve eaten here though we did eat at L’Atelier once. We brought our friends and warned them about how phenomenal it was and they did not disappoint. Starting with drinks in the small bar to being treated to the.",
      "If you have the money this is truly a wonderful restaurant to go to for that special celebration. The food, wine and service are excellent. If you can go I would.",
      "My friends and I decided to spend the evening at this top-tier restaurant.  Don't plan on other activities for the night, since if you go for the full experience, the xx-course tasting menu, you will be here for 3 plus hours. Two of us ordered.",
      "Words cannot adequately describe the experience of this restaurant. We do know they cater to the rich and famous daily BUT they treated us as if we were! Sommelier Rone gave us his full attention and described the entire history of the bottle of champagne....origin,."
    ]
  },
  {
    "name": "Mastro's Ocean Club",
    "address": "3720 Las Vegas Blvd S",
    "city": "Las Vegas",
    "state": "NV",
    "source": "TripAdvisor",
    "tags": [
      "$50 - $50",
      "Vegetarian Friendly",
      " Vegan Options",
      " Gluten Free Options",
      "Lunch",
      " Dinner",
      " Late Night",
      "American",
      " Seafood",
      "Reservations",
      " Private Dining",
      " Seating",
      " Parking Available",
      " Valet Parking",
      " Wheelchair Accessible",
      " Serves Alcohol",
      " Full Bar",
      " Accepts Credit Cards",
      " Table Service"
    ],
    "reviews": [
      "2 are for $135 no alcohol or dessert.  Chilean Sea bass excellent, cooked to perfection.  Scallops were also good.  HUGE bowl of fries with sea salt, more than shareable for 2 people.  All Ala carte .  Worth it.  Seating was in a large open air.",
      "Run here! It was such a great meal.  Beautiful restaurant and the food was fantastic.  We had the crab cocktail to start and I’ll dream of the lobster mashed potatoes for a long long time. We ended our meal with brown butter cake.  It was.",
      "My husband was skeptical at first. He had seen the restaurant in a previous trip to Vegas and thought \"who would eat in a mall?\"  Well we did and it was the best meal of our trip!  The service was great, attentive without being invasive,.",
      "In the Crystals shopping center near Cosmo, this is a beautiful restaurant the hangs over the first floor of the high end shops like it is suspended from the clouds.  Impeccable service.  The seafood tower is the ultimate appetizer but do not miss the big.",
      "In Vegas for a few days.  It happened to be Restaurant Week.  Mastro's was highly rated for seafood, so we went to check it out. The regular menu had a dizzying array of fish and seafood to choose from.  There are no preparation descriptions, so.",
      "My favorite meal of my Las Vegas stay! The shrimp appetizer was delicious! I had the crab cakes for my entree, quality crab meat and not full of filler like you sometimes get. Service was great, staff was very attentive. I highly recommend this restaurant!",
      "A truly fantastic restaurant.  Very classy with high quality service and very high quality libations and foods.   One will never be disappointed with the service or the qualify that is offered.",
      "We had an absolutely perfect dinner. The treehouse ambiance, great food and attentive, prompt service made this truly special. Must have Seafood Tower, steak, lobster mash and the Butter cake! Beyond delicious ! Never disappointed... can’t wait to come back.",
      "The major seating area is amazing and worth looking at before you are seated. The fillets where prefect. But be sure to confirm how you wanted it prepared. Medium rare is very rare. The wait staff is very helpful with this. Bread serviced. We split.",
      "The best steak restaurant in Vegas!  Staff were incredible, food amazing and beautiful atmosphere.  One of the top high end places in Vegas."
    ]
  },
  {
    "name": "Ferraro's Italian Restaurant ",
    "address": "4480 Paradise Road",
    "city": "Las Vegas",
    "state": "NV",
    "source": "TripAdvisor",
    "tags": [
      "$40 - $60",
      "Vegetarian Friendly",
      " Vegan Options",
      " Gluten Free Options",
      "Lunch",
      " Dinner",
      " Late Night",
      "Italian",
      "Takeout",
      " Reservations",
      " Outdoor Seating",
      " Private Dining",
      " Seating",
      " Parking Available",
      " Highchairs Available",
      " Wheelchair Accessible",
      " Serves Alcohol",
      " Full Bar",
      " Accepts Credit Cards",
      " Table Service"
    ],
    "reviews": [
      "We were excited to be able to return to Ferraro’s for a third time and we’re happy that the renovations had just been completed on the day we reserved \nWe went to the bar for a cocktail before dinner \nFront desk people were very nice.",
      "Sylvia, \n\nThank you so much for leaving your review and letting us know about your experience. We would like to get a few more details from you so we can look into some of the issues you described directly. We strive daily to ensure returning.",
      "Slightly off the strip but the food and the service were excellent. Just that being full, was bit noisy. But one can ignore till the food is authentic. Loved the Salmon",
      "We had to take a 10 min cab ride from the Venetian to get here but it was worth the trip from both a cost and food perspective. We are from Toronto where there is a large Italian contingent, as well, we have travelled Italy.",
      "Excellent food.  Great recommendation by the sommelier.  It did feel like the waiter was rushing us through the meal..More",
      "Hello, we are so pleased you enjoyed your meal and the recommendations by the sommelier. We want to enure you continue to enjoy your visits to Ferraro's and are concerned by your last statement. Would you mind contacting us via email at ferraros@ferraroslasvegas.com and let.",
      "I had heard the late Fox broadcaster Bob Massi compliment Ferraro's as the greatest Italian food he had ever had,  so my wife and I'm had to try it out when we were visiting Las Vegas. We were not disappointed. Don't be fooled by its.",
      "Large restaurant at the end of large \"strip mall\" off major Paradise Road. Easy in and out driving, ample parking. Menu is extensive and covers almost all the Italian variations and has an extensive appetizer section. Large space and full bar but smaller large group.",
      "Very good restaurant would recommend to anyone wanting authentic Italian food. The food was very well prepared.",
      "Italian food generally makes my boss happy, and he was very happy with this.  Had been recommended by friends and we were not disappointed.  Food good, service good, drink good, white table cloth service.  I will be back next year.",
      "I had a lot of difficulty with vegetarian options in Las Vegas.  I’m a bit of a food diva and last night I dined at the prestigious  La Giada at the Cromwell.  The reception staff clearly displayed a culture of superiority and informed me there.",
      "Wonderful restaurant with traditional Italian food and drink. We had a great surprise birthday party there and everything was perfect!"
    ]
  },
  {
    "name": "Yardbird Southern Table ",
    "address": "3355 Las Vegas Blvd S",
    "city": "Las Vegas",
    "state": "NV",
    "source": "TripAdvisor",
    "tags": [
      "$31 - $50",
      "Vegetarian Friendly",
      " Gluten Free Options",
      "Lunch",
      " Dinner",
      " Brunch",
      "American",
      "Television",
      " Free Wifi",
      " Takeout",
      " Reservations",
      " Seating",
      " Parking Available",
      " Highchairs Available",
      " Wheelchair Accessible",
      " Serves Alcohol",
      " Full Bar",
      " Accepts American Express",
      " Accepts Mastercard",
      " Accepts Visa",
      " Accepts Discover",
      " Accepts Credit Cards",
      " Table Service"
    ],
    "reviews": [
      "We thoroughly enjoyed our dinner at Yardbird.  Highly recommend Llewellyn's chicken, corn bread, and fried green tomatoes.  Service is awesome also.  A little loud but fun place with everyone enjoying the food and company.  We make this a must stop on our Las Vegas trips.",
      "Hi Kapaluacat29220,\nThank you for taking the time to review Yardbird Southern. We're so glad to hear you enjoyed our fried chicken, skillet cornbread and fried green tomato BLT. We're also glad to hear that you received awesome service and will be sure to pass.",
      "The Yardbird is located in the Venetian on restaurant row. Reservations are recommended as the place is usually always packed full. The major reason for an average rating is the drinks. We had margaritas at $20 a pop -- sorry but the drinks hardly tasted.",
      "Hi lvgirl09,\nThank you for taking the time to review Yardbird Southern. We never like to hear when a guest leaves disappointed. Please check your inbox so we can personally address your individual experience.",
      "I had shrimp and grits. They were okay, but nothing special.  My wife had a kale salad that was good.  I am not big on chicken and waffles.  They push that hard.  Probably good option if you like chicken and waffles.",
      "Good value for money in the Palazzo Venetian. Really good cocktails and beers. Get the fried chicken and waffles but skip the burgers and the sides as portions are huge.",
      "Hi Ville_VK,\nThank you for taking the time to review Yardbird Southern. We're so glad to hear you enjoyed your experience. We look forward to having you back again soon.",
      "We enjoyed the Yardbird very much, the food was great. The atmosphere was casual and friendly. As the name suggest, the chicken was awesome!",
      "Hi Firespk,\nThank you for taking the time to review Yardbird Southern. We're so glad to hear you enjoyed our fried chicken. We look forward to having you back again soon.",
      "Came for drinks after dinner. The whiskey options were very diverse and the infused banana Jack Daniels was excellent.",
      "All around good fattening southern comfort food.  We had the July 4th appetizer special which was great, shrimp and grits, biscuits and gravy and barbecue brisket burger were all good.  I wish I would have ordered the chicken instead of the crab Benedict.  I also.",
      "Hi RussU2525,\nThank you for taking the time to review Yardbird Southern. We're so glad to hear you enjoyed our 4th of July sampler, shrimp & grits, biscuits & gravy, BBQ brisket burger and peanut butter ice cream pie. We look forward to having you.",
      "Amazing food and cocktails. Service we had throughout trip to the USA was very good but our server at Yardbird was outstanding.More",
      "Hi Bobby284647,\nThank you for taking the time to review Yardbird Southern. We're so glad to hear you enjoyed your experience and will pass along your kind words to the team for taking outstanding care of you. We look forward to having you back again.",
      "We come to Vegas every year. We were in Vegas for 5 nights. I read reviews ahead of time and knew we wanted to eat here. Tried to come here the first night and it was closed for a private party. Made a reservation for.",
      "Hi NEmmerson,\nThank you for taking the time to review Yardbird Southern. We're so glad to hear you enjoyed our fried chicken, skillet cornbread, crispy Brussel sprouts and peach cobbler. We look forward to having you back again soon.",
      "Really cool place down to the table ware! Best chicken I've ever eaten!!! The greens are AMAZING, I live in the south and those are the best! Service is great even when super busy.",
      "Hi hikerap,\nThank you for taking the time to review Yardbird Southern. We're so glad to hear you enjoyed our fried chicken and collard greens. We look forward to having you back again soon."
    ]
  },
  {
    "name": "Green Leaf's ",
    "address": "875 S Grand Central Pkwy",
    "city": "Las Vegas",
    "state": "NV",
    "source": "TripAdvisor",
    "tags": [

    ],
    "reviews": [
      "My husband and I were  determined to stay close to our diet during our trip. When we found Green Leaf’s  it really made our day.\nThe Caribbean berry smoothie closely resembled what we have been eating the last 30 days and the price wasn’t bad.",
      "We found the prices on the high side but the ingedients looked fresh. All we needed was a cold drink to refresh from the heat. We had a nice smoothie and a cold, bottled drink.",
      "Stopped in at Bananas for a smoothie while shopping at the outlets. The price was a bit expensive for a standard smoothie and the service was very matt-of-fact with no real interaction other than asking what I wanted, but the drink was very good and.",
      "great variety of salads and wraps, made fresh for you at time your order\n\nwas nice to see such a refreshing option (vs junk type food).\n\nI highly recommend this place for something to eat!",
      "Lunch at outlets is always iffy but the food at Greenleaf and Bananas was an exception. Both the Thai chicken wrap and the turkey/ ham Cuban sandwich were well prepared and filling."
    ]
  }
]